Autodesk.Revit.DB.FailureMessage.SetMessageString(System.String)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessage is already posted to a document
Since:
2011

Autodesk.Revit.DB.FailureMessage.SetMessageStrings(System.String,System.String)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessage is already posted to a document
Since:
2011

Autodesk.Revit.DB.FailureMessage.AddResolution(Autodesk.Revit.DB.FailureResolutionType,Autodesk.Revit.DB.FailureResolution)
Adds a resolution for the failure.
Remarks:
Each pair of FailureResolutionType and FailureResolution must have been defined in FailureDefinition,
and could only be added once.
type:
The type of the resolution.
resolution:
The resolution.
Returns:
The FailureMessage.
Throws Autodesk.Revit.Exceptions.ArgumentException:
type is not a valid resolution type for this FailureMessage.
-or-
resolution of type is not valid for this FailureMessage.
-or-
This FailureMessage already contains a resolution of type type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessage is already posted to a document
Since:
2011

Autodesk.Revit.DB.FailureMessage.SetAdditionalElements(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Sets the additional reference elements for the failure.
Remarks:
Additional elements are used to highlight additional information to the user. They are not
considered as causing the failure, but are related to it. User cannot delete them in extended error dialog.
additionalElements:
The additional elements.
Returns:
The FailureMessage.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessage is already posted to a document
Since:
2011

Autodesk.Revit.DB.FailureMessage.SetAdditionalElement(Autodesk.Revit.DB.ElementId)
Sets the additional reference element for the failure.
Remarks:
Additional elements are used to highlight additional information to the user. They are not
considered as causing the failure, but are related to it. User cannot delete them in extended error dialog.
additionalElement:
The additional element.
Returns:
The FailureMessage.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessage is already posted to a document
Since:
2011

Autodesk.Revit.DB.FailureMessage.SetFailingElement(Autodesk.Revit.DB.ElementId)
Sets the element that has caused the failure.
Remarks:
In Revit error dialog this element will be highlighted to the user and can be deleted by user via extended error dialog.
id:
The element that has caused the failure.
Returns:
The FailureMessage.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessage is already posted to a document
Since:
2011

Autodesk.Revit.DB.FailureMessage.SetFailingElements(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Sets elements that have caused the failure.
Remarks:
In the Revit error dialog these elements will be highlighted to the user and can be deleted by user via extended error dialog.
idsToShow:
The elements that have caused the failure.
Returns:
The FailureMessage.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessage is already posted to a document
Since:
2011

Autodesk.Revit.DB.FailureMessage.#ctor(Autodesk.Revit.DB.FailureDefinitionId)
Creates a new FailureMessage related to a given FailureDefinition.
id:
Id of FailureDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentException:
id is valid or does not have corresponding failure definition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011